* Plot convergent function
#+begin_src python :results file :var filename="../figs/fig1.png"
  import numpy as np
  import matplotlib.pyplot as plt

  @np.vectorize
  def f(x):
      return (29.0 * x + 6) / (5.0 * x + 1)

  x = np.linspace(0, 20, 20)
  y1 = f(x)
  y2 = [6.0] * len(x)
  y3 = [5.8] * len(x)

  f, ax = plt.subplots()
  ax.plot(x, y1, color = 'orange')
  ax.plot(x, y2, "k--")
  ax.plot(x, y3, "k--")  
  ax.set_xlabel('x')
  ax.set_ylabel('f(x)')
  ax.set_yticks([5.8, 6.0])
  ax.set_title(r'$f(x)=\frac{29x+6}{5x+1}$')
  plt.savefig(filename)  
#+end_src

#+RESULTS:
[[file:None]]

* Plot bilinear convergent function
#+begin_src python :results file :var filename="../figs/fig2.png"
  import matplotlib.pyplot as plt
  import numpy as np
  fig = plt.figure()
  ax = fig.add_subplot(projection='3d')

  @np.vectorize
  def f(x, y):
      return (488.0 * x * y + 253.0 * x + 63.0 * y + 33.0) / (342.0 * x * y + 95 * x + 56 * y + 17)

  X = np.arange(0, 10, 0.1)
  Y = np.arange(0, 10, 0.1)
  X, Y = np.meshgrid(X, Y)
  Z = f(X, Y)
  surf = ax.plot_surface(X, Y, Z)
  ax.set_xlabel('x')
  ax.set_ylabel('y')
  ax.set_zlabel('f(x, y)')
  ax.set_title(r'$f(x, y)=\frac{488xy + 253x + 63y + 33}{342xy + 95x + 56y + 17}$')
  plt.savefig(filename)
#+end_src

#+RESULTS:
[[file:None]]

* Export for convergent tabs

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  zz=cf_convergents1_tab(islice(cf_e(),10))
  print(zz)
  zz.export_csv('../exports/cf_convergents1_tab_1.csv')
#+end_src

#+RESULTS:
:          1    6    1    1    4    1    1    2    1    2     
:  1457 1264  193  106   87   19   11    8    3    2    1    0
:   536  465   71   39   32    7    4    3    1    1    0    1
: 

* Export for transformations

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  m0 = np.array([[0, 2], [-1, 3]], int)
  zz = cf_transform_tab(islice(cf_sqrt2(), 20), m0 = m0)
  print(zz)
  zz.export_csv('../exports/cf_transform_tab_1.csv')
#+end_src

#+RESULTS:
#+begin_example
     2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  1      
                                                        4  2  0  2   
                                                     8  3  2 -1  3  1
                                                  5  2  1  0        3
                                              10  4  2  0           1
                                            5  2  1  0              4
                                        10  4  2  0                 1
                                      5  2  1  0                    4
                                  10  4  2  0                       1
                                5  2  1  0                          4
                            10  4  2  0                             1
                          5  2  1  0                                4
                      10  4  2  0                                   1
                    5  2  1  0                                      4
                10  4  2  0                                         1
              5  2  1  0                                            4
          10  4  2  0                                               1
        5  2  1  0                                                  4
    10  4  2  0                                                     1
  5  2  1  0                                                        4
  4  2  0                                                           1
  1  0                                                              4

#+end_example

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  m0 = np.array([[1, -1], [1, 1]], int)
  zz = cf_transform_tab(islice(cf_e(), 20), m0=m0)
  print(zz)
  zz.export_csv('../exports/cf_transform_tab_2.csv')
#+end_src

#+RESULTS:
#+begin_example
     1  1 12  1  1 10  1  1  8  1  1  6  1  1  4  1  1  2  1  2      
                                                           1  1 -1   
                                                        4  3  1  1  0
                                              12  7  5  2  1  1     2
                                     20 11  9  2  1  1  0  1        6
                            28 15 13  2  1  1  0  1                10
                   36 19 17  2  1  1  0  1                         14
          44 23 21  2  1  1  0  1                                  18
 52 27 25  2  1  1  0  1                                           22
  2  1  1  0  1                                                    26
  0  1                                                               

#+end_example

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  m0 = np.array([[2, 0], [0, 1]], int)
  zz = cf_transform_tab(islice(cf_e(), 20), m0=m0)
  print(zz)
  zz.export_csv('../exports/cf_transform_tab_3.csv')
#+end_src

#+RESULTS:
#+begin_example
     1  1 12  1  1 10  1  1  8  1  1  6  1  1  4  1  1  2  1  2      
                                                    16  6  4  2  0   
                                                  4  3  1  1  0  1  5
                                           14  3  2  1  1           2
                                         5  4  1  0  1              3
                                  26  4  2  2  0                    2
                                   7  1  1  0                       3
                                6  5  1                             1
                                2  2  0                             2
                         26  3  2  1                                1
                       9  8  1  0  1                                3
                42  4  2  2  0                                      4
                11  1  1  0                                         3
             10  9  1                                               1
              2  2  0                                               4
       38  3  2  1                                                  1
    13 12  1  0  1                                                  3
  4  2  2  0                                                        6
  1  1  0                                                           4

#+end_example


#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  m0 = np.array([[3, 0], [0, 1]], int)
  zz = cf_transform_tab(islice(cf_sqrt2(), 20), m0=m0)
  print(zz)
  zz.export_csv('../exports/cf_transform_tab_4.csv')
#+end_src

#+RESULTS:
#+begin_example
     2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  2  1      
                                                    21  9  3  3  0   
                                                 12  5  2  1  0  1  4
                                        41 17  7  3  1  1           4
                                     12  5  2  1  0  1              8
                            41 17  7  3  1  1                       4
                         12  5  2  1  0  1                          8
                41 17  7  3  1  1                                   4
             12  5  2  1  0  1                                      8
    41 17  7  3  1  1                                               4
 12  5  2  1  0  1                                                  8
  3  1  1                                                           4
  0  1                                                               

#+end_example

* Arithmetic convergents
#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])  
  zz = arithmetic_convergents_tab(a, b, tForAddition)
  print(zz)
  zz.export_csv('../exports/arithmetic_convergents_tab_1.csv')
#+end_src

#+RESULTS:
#+begin_example
       1   5   1   1   2        
                   2   1   0    
               1   1   0   1   2
           9   5   4   1       1
      61  11   6   5           1
 131 111  20  11               5
 727 616 111                   1
 858 727                        
                   1   0   1    
               0   0   0   0    
           2   1   1   0        
      11   2   1   1            
  26  22   4   2                
 143 121  22                    
 169 143                        

#+end_example


#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])  
  zz = arithmetic_convergents_tab(a, b, tForSubtraction)
  print(zz)
  zz.export_csv('../exports/arithmetic_convergents_tab_2.csv')
#+end_src

#+RESULTS:
#+begin_example
       1   5   1   1   2        
                   2   1   0    
              -1  -1   0  -1   2
           1   1   0   1       1
      -5  -1   0  -1           1
   1   1   0   1               5
  -1   0  -1                   1
   0   1                        
                   1   0   1    
               0   0   0   0    
           2   1   1   0        
      11   2   1   1            
  26  22   4   2                
 143 121  22                    
 169 143                        

#+end_example


#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])  
  zz = arithmetic_convergents_tab(a, b, tForDivision)
  print(zz)
  zz.export_csv('../exports/arithmetic_convergents_tab_3.csv')
#+end_src

#+RESULTS:
#+begin_example
       1   5   1   1   2        
                   2   1   0    
               0   0   0   0   2
           5   3   2   1       1
      28   5   3   2           1
  66  56  10   6               5
 363 308  55                   1
 429 364                        
                   0   0   0    
               1   1   0   1    
           4   2   2   0        
      33   6   3   3            
  65  55  10   5                
 364 308  56                    
 429 363                        

#+end_example

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = islice(cf_sqrt2(), 6)
  b = islice(cf_sqrt2(), 6)  
  zz = arithmetic_convergents_tab(a, b, tForMultiplication)
  print(zz)
  zz.export_csv('../exports/arithmetic_convergents_tab_4.csv')
#+end_src

#+RESULTS:
#+begin_example
         2    2    2    2    2    1          
                             0    0    0     
                        3    1    1    0    1
                   7    3    1    1         2
             51   21    9    3              2
       287  119   49   21                   2
 1683  697  289  119                        2
 4059 1681  697                             2
 9801 4059                                   
                             1    0    1     
                        0    0    0    0     
                   5    2    1    0          
             24   10    4    2               
       145   60   25   10                    
  840  348  144   60                         
 2030  841  348                              
 4900 2030                                   

#+end_example

* Arithmetic
#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])
  c = cf_arithmetic_tab(a, b, tForAddition)
  c.export_csv('../exports/arithmetic_tab_1.csv')
#+end_src

#+RESULTS:

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])
  c = cf_arithmetic_tab(a, b, tForSubtraction)
  c.export_csv('../exports/arithmetic_tab_2.csv')  
#+end_src

#+RESULTS:

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])
  c = cf_arithmetic_tab(a, b, tForMultiplication)
  c.export_csv('../exports/arithmetic_tab_3.csv')    
#+end_src

#+RESULTS:

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([2, 1, 1, 5, 1])
  b = iter([2, 1, 1, 5, 1])
  c = cf_arithmetic_tab(a, b, tForDivision)
  c.export_csv('../exports/arithmetic_tab_4.csv')      
#+end_src

#+RESULTS:

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = iter([1])
  b = iter([2, 1, 1, 5, 1])
  c = cf_arithmetic_tab(a, b, tForDivision)
  c.export_csv('../exports/arithmetic_tab_5.csv')        
#+end_src

#+RESULTS:

#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = islice(cf_sqrt2(), 8)
  b = islice(cf_sqrt2(), 8)
  c = cf_arithmetic_tab(a, b, tForMultiplication)
  c.export_csv('../exports/arithmetic_tab_6.csv')          
#+end_src

#+RESULTS:


#+begin_src python :exports both :noweb strip-export :results output :dir ../src/
  <<DEMO_IMPORTS>>
  a = islice(cf_sqrt2(), 10)
  b = islice(cf_e(), 10)
  c = cf_arithmetic_tab(a, b, tForAddition)
  c.export_csv('../exports/arithmetic_tab_7.csv')
#+end_src

#+RESULTS:

* Imports
#+begin_src python :tangle no :noweb-ref DEMO_IMPORTS
  from cont_frac import *
  from cont_frac_io import *
  from itertools import islice
#+end_src

